[M_IrisEp4Battle_Race MissionDefinition]
MissionDescription="The next highest-ranked gladiator on the Torgue leaderboards is named Motor Momma. She's hiding out in the [place]Southern Raceway[-place] and won't reveal herself to any but the most worthy of opponents.\nTo this end, Moxxi has suggested that you complete an event called The Death Race. As Motor Momma is obsessed with cars, she will almost certainly consider you a worthy opponent if you can beat the clock and complete the time trial."
TurnInDescription="You've gotten Momma's attention, and she wants to fight you. Now it's time to make her sorely regret that decision."

[M_IrisEp4Battle_Race2 MissionDefinition]
MissionSummary="You may have completed the Death Race, but you ain't seen nothing yet. If you wanna be a true badass, the Torgue corporation recommends completing a new, more difficult time trial event. Hit the gas!"

[M_IrisEp4Battle_Race2:FinishLine MissionObjectiveDefinition]
ProgressMessage="Reach finish line"

[M_IrisEp4Battle_Race4 MissionDefinition]
MissionSummary="Do you have what it takes to be the best? If you wanna be a true badass, the Torgue corporation recommends completing a new, even more difficult time trial event. Hit the gas!"

[M_IrisEp4Battle_Race4:FinishLine MissionObjectiveDefinition]
ProgressMessage="Reach finish line"

[M_IrisEp4Battle_Race:FinishLine MissionObjectiveDefinition]
ProgressMessage="Reach finish line"

[M_IrisEp4Battle_RaceR4:FinishLine MissionObjectiveDefinition]
ProgressMessage="Reach finish line"
